results/nemotron-3.5-lightning-30b/raw/throughput_sweep_extended/sweep.log
vllm_ornith
8ad3a89094d137c0c298599a6d68d2993fb1934de4a4bd4e1b1e9d11691fd397
READY model=nvidia/NVIDIA-Nemotron-3.5-Lightning-30B-A3B-NVFP4 poll=25
CANARY 'LIGHTNING_OK' stop
=== concurrency=192 num_prompts=384 engine_running_before=0 ===
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xee579a02e020>, trust_remote_code=False, seed=0, num_prompts=384, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=192, model='nvidia/NVIDIA-Nemotron-3.5-Lightning-30B-A3B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-103a30ec-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 15:38:15 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 192
100%|██████████| 384/384 [01:57<00:00,  3.27it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     384       
Failed requests:                         0         
Maximum request concurrency:             192       
Benchmark duration (s):                  117.52    
Total input tokens:                      196608    
Total generated tokens:                  98304     
Request throughput (req/s):              3.27      
Output token throughput (tok/s):         836.51    
Peak output token throughput (tok/s):    1342.00   
Peak concurrent requests:                204.00    
Total token throughput (tok/s):          2509.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          5940.55   
Median TTFT (ms):                        2474.24   
P50 TTFT (ms):                           2474.24   
P90 TTFT (ms):                           15576.36  
P99 TTFT (ms):                           19365.74  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          202.83    
Median TPOT (ms):                        212.08    
P50 TPOT (ms):                           212.08    
P90 TPOT (ms):                           217.02    
P99 TPOT (ms):                           219.26    
---------------Inter-token Latency----------------
Mean ITL (ms):                           202.83    
Median ITL (ms):                         171.88    
P50 ITL (ms):                            171.88    
P90 ITL (ms):                            408.21    
P99 ITL (ms):                            419.59    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          57662.22  
Median E2EL (ms):                        56389.26  
P50 E2EL (ms):                           56389.26  
P90 E2EL (ms):                           70903.71  
P99 E2EL (ms):                           74702.56  
==================================================

=== concurrency=256 num_prompts=384 engine_running_before=0 ===
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfee2bae88e00>, trust_remote_code=False, seed=0, num_prompts=384, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='nvidia/NVIDIA-Nemotron-3.5-Lightning-30B-A3B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-9e9c6b67-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 15:40:21 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
  0%|          | 0/384 [00:00<?, ?it/s]Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 384/384 [01:55<00:00,  3.33it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     384       
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  115.34    
Total input tokens:                      196608    
Total generated tokens:                  98304     
Request throughput (req/s):              3.33      
Output token throughput (tok/s):         852.33    
Peak output token throughput (tok/s):    1535.00   
Peak concurrent requests:                268.00    
Total token throughput (tok/s):          2556.99   
---------------Time to First Token----------------
Mean TTFT (ms):                          9428.25   
Median TTFT (ms):                        6167.51   
P50 TTFT (ms):                           6167.51   
P90 TTFT (ms):                           22806.81  
P99 TTFT (ms):                           26849.44  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          223.02    
Median TPOT (ms):                        255.47    
P50 TPOT (ms):                           255.47    
P90 TPOT (ms):                           265.95    
P99 TPOT (ms):                           267.49    
---------------Inter-token Latency----------------
Mean ITL (ms):                           223.02    
Median ITL (ms):                         208.46    
P50 ITL (ms):                            208.46    
P90 ITL (ms):                            438.88    
P99 ITL (ms):                            450.99    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          66297.42  
Median E2EL (ms):                        73131.73  
P50 E2EL (ms):                           73131.73  
P90 E2EL (ms):                           86093.12  
P99 E2EL (ms):                           87466.49  
==================================================

=== concurrency=384 num_prompts=384 engine_running_before=0 ===
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe37cb40ccd60>, trust_remote_code=False, seed=0, num_prompts=384, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=384, model='nvidia/NVIDIA-Nemotron-3.5-Lightning-30B-A3B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-4fb995d8-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 15:42:24 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 384
100%|██████████| 384/384 [01:46<00:00,  3.62it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     384       
Failed requests:                         0         
Maximum request concurrency:             384       
Benchmark duration (s):                  106.14    
Total input tokens:                      196608    
Total generated tokens:                  98304     
Request throughput (req/s):              3.62      
Output token throughput (tok/s):         926.18    
Peak output token throughput (tok/s):    1536.00   
Peak concurrent requests:                384.00    
Total token throughput (tok/s):          2778.53   
---------------Time to First Token----------------
Mean TTFT (ms):                          20951.44  
Median TTFT (ms):                        19872.59  
P50 TTFT (ms):                           19872.59  
P90 TTFT (ms):                           40169.85  
P99 TTFT (ms):                           45230.70  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          307.52    
Median TPOT (ms):                        315.58    
P50 TPOT (ms):                           315.58    
P90 TPOT (ms):                           342.68    
P99 TPOT (ms):                           344.78    
---------------Inter-token Latency----------------
Mean ITL (ms):                           307.53    
Median ITL (ms):                         290.69    
P50 ITL (ms):                            290.69    
P90 ITL (ms):                            465.16    
P99 ITL (ms):                            511.29    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          99368.33  
Median E2EL (ms):                        100342.82 
P50 E2EL (ms):                           100342.82 
P90 E2EL (ms):                           105629.77 
P99 E2EL (ms):                           106107.60 
==================================================

STAGE1_DONE